posts/code-review.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-12-20 Mon 05:08 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Video Code Review</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Sean Gallagher">
<link
    href="https://cdn.simplecss.org/simple.min.css"
    rel="stylesheet"
    type="text/css"
/>
<link
    href="/styles/styles.css"
    rel="stylesheet"
    type="text/css"
/>
</head>
<body>
<header id="header" class="status">
<h1>Sean Gallagher</h1>
<nav>
  <a href="/">Home</a>
  <a href="/stocks.html">The STOCKS Application</a>
  <a href="/build.html">How it's Made</a>
</nav>
</header>
<main id="content">
<div id="outline-container-org1792179" class="outline-2">
<h2 id="org1792179">Before: The Existing STOCKS Application</h2>
<div class="outline-text-2" id="text-org1792179">
<div style="padding:56.25% 0 0 0;position:relative;">
    <iframe
        src="https://player.vimeo.com/video/658176706?h=df0a786daa&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479"
        frameborder="0"
        allow="autoplay; fullscreen; picture-in-picture"
        allowfullscreen
        style="position:absolute;top:0;left:0;width:100%;height:100%;"
        title="STOCKS Application Code Review"
    ></iframe>
</div>
<script src="https://player.vimeo.com/api/player.js"></script>
<div style="text-align: center">
<p>
[This is a transcript of the video code review.]<br>
</p>
</div>
<p>
Hello!
My name is Sean Gallagher,
    and this is a video code review
    for my professional portfolio.
This video will examine
    the original Javascript codebase
    that I developed for CS-340:
    Client-Server Development,
    and touch on its relationship
    to the final full-stack application,
    produced during my Computer Science capstone experience.
The project consists of three categories:
    Software Engineering and Design,
    Data Structures and Algorithms,
    and Databases,
    and the original application is enhanced
    in each of these categories.
Along with establishing the foundation
    on which the portfolio application was built
    through a discussion of the original application's
    functionality and code quality,
    this video will also touch
    on the enhancements that were originally proposed.
</p>
</div>
<div id="outline-container-orga2a9f5d" class="outline-3">
<h3 id="orga2a9f5d">Software Engineering and Design</h3>
<div class="outline-text-3" id="text-orga2a9f5d">
<p>
The first category was Software Engineering and Design,
    and it was far and away the most grandiose,
    both in terms of the scope of the existing codebase
    covered by the category
    and the scale of the ambitious enhancement I proposed.
</p>
</div>
<div id="outline-container-org8610038" class="outline-4">
<h4 id="org8610038">Existing Functionality</h4>
<div class="outline-text-4" id="text-org8610038">
<p>
The existing code implements an architectural pattern
    common to Node.js/Express applications,
    which divides the application
    into layers for routing,
    controllers,
    services,
    and data access.
It probably has a proper name,
    but I don't remember it,
    and I can't seem to find it.
The Express server framework
    provides routing and HTTP handling functionality
    within the routes and controllers layers,
    the services layer contains business logic,
    and the database layer
    wraps the MongoDB Javascript driver API
    and abstracts its complexity.
The existing code also includes a rudimentary Bash client.
This client works more than well enough for testing — so
    much so that I continued to use
    its fundamental principles to test the expanded API
    throughout the project — but
    it is far from the polished experience
    that most modern consumers expect.
Therefore, the client experience became the focus
    for the Software Design and Engineering milestone.
</p>
</div>
</div>
<div id="outline-container-org9f14726" class="outline-4">
<h4 id="org9f14726">Code Analysis</h4>
<div class="outline-text-4" id="text-org9f14726">
<p>
The existing codebase is actually
    something I'm rather proud of.
It's well documented,
    with rich docstring comments,
    containing type information that would prove invaluable
    in constructing the Data Structures enhancement,
    and it coherently follows the pattern typically used
    for Express application development
    against a MongoDB back end.
It does have a fair amount of legacy code,
    which makes the overall codebase a little confusing.
Notably, whole files, like this <code>basicApp.js</code> file,
    are entirely irrelevant to the final API.
</p>
</div>
</div>
<div id="outline-container-orgff0b599" class="outline-4">
<h4 id="orgff0b599">Enhancement</h4>
<div class="outline-text-4" id="text-orgff0b599">
<p>
The proposed enhancement for this category was
    an Angular single-page web application,
    which would replicate
    the existing functionality of this Bash client
    and add charting capabilities.
Angular implements a variation
    of common front-end architectural paradigms,
    like MVC and MVVM.
Early versions facetiously referred to AngularJS,
    Angular's predecessor,
    as an MVW architecture,
    which stood for "Model-View-Whatever."
The architecture,
    as it exists today,
    is component-based,
    and similar to other front-end Javascript frameworks,
    like React and Vue.
</p>
</div>
</div>
</div>
<div id="outline-container-org13db6f3" class="outline-3">
<h3 id="org13db6f3">Data Structures and Algorithms</h3>
<div class="outline-text-3" id="text-org13db6f3">
<p>
Our second category pertained
    to Data Structures and Algorithms.
</p>
</div>
<div id="outline-container-orgec94cb3" class="outline-4">
<h4 id="orgec94cb3">Existing Functionality</h4>
<div class="outline-text-4" id="text-orgec94cb3">
<p>
The existing application is relatively weak in this category.
MongoDB handles much of the data processing
    within the database server, itself,
    and it returns the data — through the Javascript driver — as
    native Javascript objects.
As a result,
    the existing application is essentially data-agnostic,
    and it enforces only basic conditions
    on the data structures it receives from the driver.
</p>
</div>
</div>
<div id="outline-container-org5d91144" class="outline-4">
<h4 id="org5d91144">Code Analysis</h4>
<div class="outline-text-4" id="text-org5d91144">
<p>
The only time the code really addresses this category
    are in the few places where it implements checks
    to ensure data integrity.
In particular, the v1.0 API — implemented
    in part here in ~services/stocks.js~ — checks
    to ensure that new stock records
    do not duplicate existing ticker symbols.
Everything else is open to interpretation,
    which constitutes a substantial risk
    to system stability and, probably, security.
</p>
</div>
</div>
<div id="outline-container-org2107203" class="outline-4">
<h4 id="org2107203">Enhancement</h4>
<div class="outline-text-4" id="text-org2107203">
<p>
The enhancement in the
    Data Structures and Algorithms category
    aims to address this shortcoming
    by reimplementing the server application in Typescript,
    which provides static typing
    that will enforce a consistent data model.
Additionally,
    the new application will implement schema validation
    as an extra layer of protection
    to ensure that inconsistent data
    is not stored in the database.
</p>
</div>
</div>
</div>
<div id="outline-container-orge48fc5f" class="outline-3">
<h3 id="orge48fc5f">Databases</h3>
<div class="outline-text-3" id="text-orge48fc5f">
</div>
<div id="outline-container-orgc071fb4" class="outline-4">
<h4 id="orgc071fb4">Existing Functionality</h4>
<div class="outline-text-4" id="text-orgc071fb4">
<p>
The existing database code essentially implements wrappers
    around MongoDB's Javascript driver
    to abstract some of the complexity
    of establishing and managing database connections.
The existing system drew data from a static JSON file,
    and only changed based on user manipulations.
</p>
</div>
</div>
<div id="outline-container-org374454c" class="outline-4">
<h4 id="org374454c">Code Analysis</h4>
<div class="outline-text-4" id="text-org374454c">
<p>
The database code is pretty good, overall.
In all but one case,
    this <code>dataAggregate</code> function here,
    I use destructuring assignment
    to handle optional configuration,
    which is an excellent use of modern Javascript features.
If I could do it again,
    I'd almost certainly prefer that from the beginning
    over the much more cumbersome
    ternary assignment statements that I used in this case.
Unlike the other layers
    (and the controller layer, in particular),
    the database code is much more streamlined.
As the functionality it provides is fairly close
    to that offered by the MongoDB driver itself,
    it had less of a chance to accumulate legacy cruft
    over the course of its relatively brief development.
</p>
</div>
</div>
<div id="outline-container-orgb510980" class="outline-4">
<h4 id="orgb510980">Enhancement</h4>
<div class="outline-text-4" id="text-orgb510980">
<p>
The database enhancement was to be a REST client service
    that reached out to a third-party market data provider
    to fetch real-world stock market data.
Since the various third-party providers I researched
    make fundamentally related data available
    through multiple API endpoints,
    this service would have to fetch data
    from several sources for each stock
    and synthesize that data into a single stock record
    consistent with the data model
    defined in the Data Structures enhancement.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc2d3662" class="outline-3">
<h3 id="orgc2d3662">Conclusion</h3>
<div class="outline-text-3" id="text-orgc2d3662">
<p>
Ultimately,
    the original proposal boiled down
    to a near-complete rewrite of the STOCKS application.
While Typescript's status as a superset of Javascript
    implied that the project could, in theory,
    benefit from a non-trivial amount of code reuse,
    the concurrent shift
    to the Typescript-native NestJS server framework
    meant that the application was essentially rewritten
    from the ground up.
Fortunately,
    NestJS made this process relatively painless,
    and the fundamental concepts
    remained essentially the same.
The result, in my clearly-unbiased opinion,
    was certainly worth the effort.
Thank you.
</p>
</div>
</div>
</div>
</main>
<footer id="footer" class="status">
<p>&copy;&thinsp;2021 Sean Gallagher<br><a href="mailto:seangllghr@gmail.com">seangllghr@gmail.com</a></p>
</footer>
</body>
</html>
